package org.example.GUI;

/**
 * Інтерфейс `Panel` визначає базові методи для всіх панелей GUI.
 * Кожна панель повинна реалізовувати ці методи для ініціалізації, рендерингу та очищення ресурсів.
 *
 * Основні методи:
 * - `init()` – викликається для ініціалізації панелі перед її використанням.
 * - `render()` – відповідає за відображення панелі в інтерфейсі.
 * - `cleanup()` – звільняє ресурси перед закриттям програми.
 *
 * @author Вадим Овсюк
 * @version 0.8
 * @since 2025-03-23
 */

public interface Panel {
    void render();
    void init();
    void cleanup();
}
